OpFile/externalSolarLoadV5/0.orig/airRegion/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inLetAir
    {
        type            calculated;
        value           uniform 0;
    }
    outLetAir
    {
        type            calculated;
        value           uniform 0;
    }
    yFront
    {
        type            calculated;
        value           uniform 0;
    }
    yBack
    {
        type            calculated;
        value           uniform 0;
    }
    groundWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           uniform 0;
    }
    airRegion_to_panel
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
