OpFile/externalSolarLoadV5/constant/panel/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/panel/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


1
(
    panel_to_airRegion
    {
        type            mappedWall;
        inGroups        1 ( wall );
        nFaces          19968;
        startFace       95100;
        sampleMode      nearestPatchFace;
        sampleRegion    airRegion;
        samplePatch     airRegion_to_panel;
    }

)


// ************************************************************************* //
