OpFile/externalSolarLoadV5/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Type of mesh generation:
//  - castellated (default)
//  - castellatedBufferLayer
//type            castellatedBufferLayer;


// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       false;



geometry
{
    panel1.stl
    {
        type triSurfaceMesh;
        name panel;
        cellZone panel;
        cellZoneInside inside;
    }
};


// Settings for the castellatedMesh generation.
castellatedMeshControls
{
    maxLocalCells 100000;
    maxGlobalCells 2000000;
    minRefinementCells 0;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 1;
    features
    (
        
    );

    refinementSurfaces
    {
        panel
        {
        level (1 2);
        }
    }
    resolveFeatureAngle 30;

    planarAngle 30;

    refinementRegions
    {
        // 针对panel几何体的距离加密（核心：锚定空间范围+合理加密）
    panel
    {
        mode        distance;  // 基于与panel的距离进行加密
        // levels ((距离 加密级别)) 
        // 规则：距离越小，加密级别越高（建议和refinementSurfaces的level匹配）
        levels      (
            (0.01 4)   // 距离panel 0.01m内，加密到第4级（最精细）
            (0.05 3)   // 0.01~0.05m内，加密到第3级
            (0.1  2)   // 0.05~0.1m内，加密到第2级
            (0.2  1)   // 0.1~0.2m内，加密到第1级（基础级别）
        );
        // 可选：强制限定加密的空间范围，避免无意义加密
        boundingBox (-10 -10 -10) (10 10 10); // 和geometry里的boundingBox一致
    }

    // 可选：全局背景网格加密（确保整体网格不会太粗）
    background
    {
        mode        box;       // 基于盒子范围加密
        box         (-15 -15 -15) (15 15 15); // 覆盖整个计算域
        levels      ((0 1));   // 背景网格基础加密级别
    }
    }
    limitRegions
    {
       
    }
    allowFreeStandingZoneFaces false;

    locationsInMesh
    ( 
        ((3 5 1) airRegion)    // 空气区域内部点
        ((0.1 0.1 0.1) panel) 
    );
        // Per synthesised faceZone name the faceType and type of baffles to
        // create
        faceZoneControls
        {
        }
}

    
// Settings for the snapping.
snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

// Settings for the layer addition.
addLayersControls
{
    relativeSizes true;
        expansionRatio 1.0;
        finalLayerThickness 0.3;
    minThickness 0.1;
    layers
    {
    }
    nGrow 0;
        featureAngle 120;
        maxFaceThicknessRatio 0.5;
        nSmoothSurfaceNormals 1;
        nSmoothThickness 10;
        minMedialAxisAngle 90;
        maxThicknessToMedialRatio 0.3;
        nSmoothNormals 3;
        slipFeatureAngle 30;
        nRelaxIter 5;
        nBufferCellsNoExtrude 0;
        nLayerIter 50;
        nRelaxedIter 20;
}
meshQualityControls
{
    #include "meshQualityDict"


    relaxed
    {
        maxNonOrtho 75;
    }
        nSmoothScale 4;
        errorReduction 0.75;
}


mergeTolerance 1e-6;

// ************************************************************************* //
